app/controllers/api/v1/job_applications_controller.rb

  def create
    @job = Job.find_by_id(params[:job_id])

    return render json: {message: "Job Not found"}, status: :not_found if @job.nil?

    @job_application = JobApplication.new
    @job_application.job_id = @job.id
    @job_application.user_id = @current_user.id
    @job_application.status = 0

    if @current_user == @job.employer
      return render json: {"message": "perekrut tidak bisa melamar di pekerjaan sendiri"}
    end

    if @current_user.job_applications.where(job_id: @job_application.job_id).length > 0
      return render json: {"message": "You have already applied for this job"}, status: :bad_request
    end

    if @job_application.save
---
SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."user_id" = $1 AND "job_applications"."job_id" = $2  [["user_id", 6], ["job_id", 6]]
INSERT INTO "job_applications" ("user_id", "job_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 6], ["job_id", 1], ["status", 0], ["created_at", "2022-11-02 07:47:51.637422"], ["updated_at", "2022-11-02 07:47:51.637422"]]

  def accept_worker
    @job_application = JobApplication.find_by_id(params[:job_application_id])
---
SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def set_job_application
      @job_application = JobApplication.find(params[:id])
---
SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]