app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def set_user
    user_id = params[:id].present? ? params[:id].to_i : params[:user_id].to_i
    @user = User.find(user_id)