app/models/job_application.rb

  def self.display_all(params)
    page = params[:page].present? ? params[:page].to_i : 1
    per_page = params[:per_page].present? ? params[:per_page].to_i : 10
    status = params[:status]
    job = Job.find_by_id(params[:job_id])
    user = User.find_by_id(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]