app/models/user.rb

  def self.display_all(params)
    user_type = params[:user_type]
    page = params[:page].present? ? params[:page].to_i : 1
    per_page = params[:per_page].present? ? params[:per_page].to_i : 10
    province = params[:province]
    regency = params[:regency]
    district = params[:district]

    condition = {}
    condition[:user_type] = user_type if user_type.present?
    condition[:province] = province if province.present?
    condition[:regency] = regency if regency.present?
    condition[:district] = district if district.present?

    users = User.where(condition).order(:updated_at).paginate(page: page, per_page: per_page)

    return {
      total_items: users.total_entries,
      total_page: users.total_pages,
      current_page: page,
      per_page: per_page,
      data: {
        users: users.map { |user| user.new_attribute }
---
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" ORDER BY "users"."updated_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]

  def points
    total_receivings = Transaction.where(receiver_id: self.id, is_verified: true).sum(:amount)
---
SELECT SUM("transactions"."amount") FROM "transactions" WHERE "transactions"."receiver_id" = $1 AND "transactions"."is_verified" = $2  [["receiver_id", 1], ["is_verified", true]]